<!-- GitHub Actions Terraform PR comment bot -->
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
github_repository.repo[".github"]: Refreshing state... [id=.github]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_ruleset.all_repositories[".github/main_branch"] will be created
  + resource "github_repository_ruleset" "all_repositories" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch"
      + node_id     = (known after apply)
      + repository  = ".github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = false
          + deletion                      = false
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @bruzina, Action: `pull_request`*